Tekla Open API Reference for Tekla Structures 2025
BoltItem Properties
The BoltItem type exposes the following members.
Properties
Name | Description
Lengths
 The bolt item's length values.
Size
 The bolt item's size.
Standard
 The bolt item's grade.
Type
 The bolt item's type.
Top
See Also
Reference
BoltItem Class
Tekla.Structures.Catalogs Namespace